var TESTER;

function chart(){

/* 都道府県別 */
var data2 = [{
  type: 'bar',
  x: [1,1,1,1,1,1,1,1,2,2,2,2,3,3,3,3,3,3,4,4,4,5,5,5,10,11,13,17,17,31,32,52,69,100,105,122,153],
  y: ['宮城県','秋田県','福井県','広島県','山口県','香川県','佐賀県','大分県','福島県','茨城県','山梨県','愛媛県','栃木県','長野県','岐阜県','静岡県','宮崎県','沖縄県','滋賀県','奈良県','福岡県','石川県','三重県','熊本県','群馬県','高知県','和歌山県','新潟県','京都府','千葉県','埼玉県','神奈川県','兵庫県','大阪府','東京都','愛知県','北海道'],
  orientation: 'h',
  marker:{color: '#228b22'}
}];

var layout2 = { title: '新型コロナウイルス統計' };

Plotly.newPlot('todouh', data2, layout2);

/* インフルエンザ */
var data3 = [{
  type: 'bar',
  x: [4850,4972,5929,6262,6786,6822,6913,7973,8235,8479,8777,8942,10787,10942,11291,11523,12248,12369,12934,13321,13387,13549,14739,15161,15326,15596,16298,16303,18923,18991,19060,19504,20954,21056,21474,22588,23659,24577,35841,44272,44437,50910,55362,56618,58199,64120,71011],
  y: ['鳥取県','徳島県','和歌山県','島根県','香川県','福井県','山梨県','佐賀県','奈良県','山形県','富山県','高知県','滋賀県','石川県','愛媛県','栃木県','秋田県','青森県','大分県','岩手県','宮崎県','三重県','熊本県','山口県','長崎県','群馬県','岡山県','岐阜県','福島県','長野県','新潟県','宮城県','鹿児島県','茨城県','広島県','京都府','静岡県','沖縄県','兵庫県','千葉県','福岡県','愛知県','埼玉県','大阪府','北海道','神奈川県','東京都']
,
  orientation: 'h',
  marker:{color: '#228b22'}
}];

var layout3 = { title: '＜参考＞季節性インフルエンザ統計' };

Plotly.newPlot('todoui', data3, layout3);

/* 年代別統計 */
/* 男性 */
var trace1 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [2,19,28,45,42,22,14,7,1,5],
  name: '男性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#4169e1'
  }
};

/* 女性 */
var trace2 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [1,8,20,26,28,19,17,15,1,1],
  name: '女性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#ffb6c1'
  }
};

var data = [trace2, trace1];

var layout = {title: "年代別集計", showlegend: false};

Plotly.newPlot('nendai', data, layout);

w_ini();

ni_ini();

}