var TESTER;

function chart(){

/* 都道府県別 */
var data2 = [{
  type: 'bar',
  x: [1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,3,3,4,4,5,5,11,12,14,14,18,25,37,37,70,73,108,127],
  y: ['愛媛県','宮崎県','宮城県','群馬県','広島県','山口県','滋賀県','秋田県','大分県','福島県','岐阜県','山梨県','静岡県','長野県','栃木県','沖縄県','福岡県','三重県','奈良県','熊本県','石川県','高知県','和歌山県','京都府','新潟県','埼玉県','千葉県','神奈川県','兵庫県','東京都','大阪府','愛知県','北海道'],
  orientation: 'h',
  marker:{color: '#228b22'}
}];

var layout2 = { title: '都道府県別統計' };

Plotly.newPlot('todouh', data2, layout2);


/* 年代別統計 */
/* 男性 */
var trace1 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [0,18,24,44,38,20,14,7,1,4],
  name: '男性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#4169e1'
  }
};

/* 女性 */
var trace2 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [1,7,16,25,24,17,13,14,1,0],
  name: '女性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#ffb6c1'
  }
};

var data = [trace2, trace1];

var layout = {title: "年代別集計", showlegend: false};

Plotly.newPlot('nendai', data, layout);

w_ini();

ni_ini();

}