var TESTER;

function chart(){

/* 都道府県別 */
var data2 = [{
  type: 'bar',
  x: [1,1,1,1,1,1,1,1,1,1,2,2,2,2,3,3,3,3,4,4,5,5,11,12,14,14,21,27,40,48,76,77,111,135],
  y: ['福島県','大分県','秋田県','滋賀県','山口県','佐賀県','広島県','宮城県','宮崎県','愛媛県','栃木県','長野県','山梨県','岐阜県','福岡県','静岡県','群馬県','沖縄県','奈良県','三重県','石川県','熊本県','高知県','和歌山県','新潟県','京都府','埼玉県','千葉県','神奈川県','兵庫県','大阪府','東京都','愛知県','北海道'],
  orientation: 'h',
  marker:{color: '#228b22'}
}];

var layout2 = { title: '都道府県別統計' };

Plotly.newPlot('todouh', data2, layout2);


/* 年代別統計 */
/* 男性 */
var trace1 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [2,19,28,45,42,22,14,7,1,5],
  name: '男性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#4169e1'
  }
};

/* 女性 */
var trace2 = {
  y: ['90代', '80代', '70代','60代', '50代', '40代', '30代', '20代', '10代', '10歳未満'],
  x: [1,8,20,26,28,19,17,15,1,1],
  name: '女性',
  type: 'bar',
  orientation: 'h',
  marker: {
    color: '#ffb6c1'
  }
};

var data = [trace2, trace1];

var layout = {title: "年代別集計", showlegend: false};

Plotly.newPlot('nendai', data, layout);

w_ini();

ni_ini();

}